# CannotBorrowBusyContention Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..EditingFailures..::..CannotBorrowBusyContention Property
BuiltInFailures..::..EditingFailures Class See Also
---
Can't obtain permission to edit the element. The Central Model is busy.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotBorrowBusyContention { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotBorrowBusyContention As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotBorrowBusyContention {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..EditingFailures Class
Autodesk.Revit.DB Namespace